{"keras_version": "2.2.4", "config": {"name": "sequential_3", "layers": [{"config": {"use_bias": true, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 64, 64, 1], "trainable": true, "data_format": "channels_last", "filters": 64, "activation": "linear", "strides": [1, 1], "bias_constraint": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_13", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"center": true, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_15", "scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "filters": 64, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_14", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"center": true, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_16", "scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_6"}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "name": "dropout_7", "seed": null, "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "filters": 128, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_15", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"center": true, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_17", "scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "filters": 128, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_16", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"center": true, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_18", "scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_7"}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "name": "dropout_8", "seed": null, "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "filters": 256, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_17", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"center": true, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_19", "scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "filters": 256, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_18", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"center": true, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_20", "scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "filters": 256, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_19", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"center": true, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_21", "scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_8"}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "name": "dropout_9", "seed": null, "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "filters": 256, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_20", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"center": true, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_22", "scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_23", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "filters": 256, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_21", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"center": true, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_23", "scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_24", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "filters": 256, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_22", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"center": true, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_24", "scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_25", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_9"}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "name": "dropout_10", "seed": null, "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_2", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "bias_constraint": null, "units": 1024, "kernel_constraint": null, "name": "dense_4", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"center": true, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_25", "scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_26", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"noise_shape": null, "name": "dropout_11", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "bias_constraint": null, "units": 1024, "kernel_constraint": null, "name": "dense_5", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"center": true, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_26", "scale": true, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_27", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"noise_shape": null, "name": "dropout_12", "seed": null, "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "bias_constraint": null, "units": 8, "kernel_constraint": null, "name": "dense_6", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_28", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}]}, "class_name": "Sequential", "backend": "tensorflow"}